<a href="https://colab.research.google.com/github/luasampaio/CienciaDados/blob/main/SeriesPandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
print("Pandas version", pd.__version__)

Pandas version 2.2.2

In [2]:
dados = ['Maçã','Banana','Laranja']
s = pd.Series(dados)
print(dados)

['Maçã', 'Banana', 'Laranja']

In [3]:
idade = [31, 33, 2, 29, 60, 58, 31, 45, 24]

In [4]:
s_idade = pd.Series(idade)
s_idade

0    31
1    33
2     2
3    29
4    60
5    58
6    31
7    45
8    24
dtype: int64

In [5]:
# Métodos das Séries
media = s_idade.mean()
variancia = s_idade.var()
des_pad = s_idade.std()
describe = s_idade.describe()
describe

count     9.000000
mean     34.777778
std      17.802934
min       2.000000
25%      29.000000
50%      31.000000
75%      45.000000
max      60.000000
dtype: float64

In [6]:
nova_idade=[]
for i in idade:
    if i >= 30:
        nova_idade.append(i)

In [7]:
nova_idade

[31, 33, 60, 58, 31, 45]

In [8]:
nova_idade = pd.Series(nova_idade)
nova_idade

0    31
1    33
2    60
3    58
4    31
5    45
dtype: int64

In [9]:
nova_idade.describe()

count     6.000000
mean     43.000000
std      13.461055
min      31.000000
25%      31.500000
50%      39.000000
75%      54.750000
max      60.000000
dtype: float64